src/DataProcessors/ВключениеОтключениеРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВключениеОтключениеРегламентныхЗаданий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДанныеОВремениВключенияОтключенияРегламентныхЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОтключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ВключениеОтключениеРегламентныхЗаданий/Ext/ObjectModule.bsl
Функция ОбновитьЗаписьРегистра(вхОтбор, вхОтключено, вхВключено)
	Попытка
		ДанныеВклОткл = РегистрыСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.СоздатьНаборЗаписей();
		ДанныеВклОткл.Отбор.Период.Установить(вхОтбор.Период);
		ДанныеВклОткл.Отбор.РегламентноеЗадание.Установить(вхОтбор.РегламентноеЗадание);
		ДанныеВклОткл.Отбор.ДатаОтключения.Установить(вхОтбор.ДатаОтключения);
		ДанныеВклОткл.Отбор.ДатаВключения.Установить(вхОтбор.ДатаВключения);
		ДанныеВклОткл.Прочитать();
		Для Каждого Запись Из ДанныеВклОткл Цикл
			Запись.Отключено = вхОтключено;
			Запись.Включено = вхВключено;
		КонецЦикла;
		
		ДанныеВклОткл.Записать(Истина);
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции
		
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Р.РегламентноеЗадание.ИдентификаторРегламентногоЗадания КАК ИдентификаторРЗ,
	|	Р.Период,
	|	Р.РегламентноеЗадание,
	|	Р.ДатаОтключения,
	|	Р.ДатаВключения,
	|	Р.РегламентноеЗадание.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий КАК Р
	|ГДЕ
	|	НЕ Р.Отключено
	|	И Р.ДатаОтключения <= &ТекущаяДата
	|	И Р.ДатаВключения > &ТекущаяДата"
	);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	тхтТемаПисьма = "включение/отключение регламентных заданий";
	тхтТекстПисьма = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ДатаОтключения) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторРЗ);
			РЗ.Использование = Ложь;
			РЗ.Записать();
			
			Если НЕ ОбновитьЗаписьРегистра(Выборка, Истина, Ложь) Тогда
				ВызватьИсключение "не удалось обновить запись регистра данных о включении/отключении";
			КонецЕсли;			
			
			ЗафиксироватьТранзакцию();
			
			тхтТекстПисьма = ?(ПустаяСтрока(тхтТекстПисьма), тхтТекстПисьма, тхтТекстПисьма + Символы.ПС);
			тхтТекстПисьма = тхтТекстПисьма + Формат(ТекущаяДата(), "") + " регламентное задание " + Выборка.Наименование + " было отключено";
			тхтТекстПисьма = тхтТекстПисьма + Символы.ПС;
			
		Исключение
			ОтменитьТранзакцию();
			
			тхтТекстПисьма = ?(ПустаяСтрока(тхтТекстПисьма), тхтТекстПисьма, тхтТекстПисьма + Символы.ПС);
			тхтТекстПисьма = тхтТекстПисьма + "регламентное задание " + Выборка.Наименование + " не было отключено" + Символы.ПС;
			тхтТекстПисьма = тхтТекстПисьма + ОписаниеОшибки();
			тхтТекстПисьма = тхтТекстПисьма + Символы.ПС;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р.РегламентноеЗадание.ИдентификаторРегламентногоЗадания КАК ИдентификаторРЗ,
	|	Р.Период,
	|	Р.РегламентноеЗадание,
	|	Р.ДатаОтключения,
	|	Р.ДатаВключения,
	|	Р.РегламентноеЗадание.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий КАК Р
	|ГДЕ
	|	НЕ Р.Включено
	|	И Р.ДатаВключения <= &ТекущаяДата";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ДатаВключения) Тогда
			Продолжить;
		КонецЕсли;
			
		НачатьТранзакцию();
		Попытка
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторРЗ);
			РЗ.Использование = Истина;
			РЗ.Записать();
			
			Если НЕ ОбновитьЗаписьРегистра(Выборка, Истина, Истина) Тогда
				ВызватьИсключение "не удалось обновить запись регистра данных о включении/отключении";
			КонецЕсли;			
			
			ЗафиксироватьТранзакцию();
			
			тхтТекстПисьма = ?(ПустаяСтрока(тхтТекстПисьма), тхтТекстПисьма, тхтТекстПисьма + Символы.ПС);
			тхтТекстПисьма = тхтТекстПисьма + Формат(ТекущаяДата(), "") + " регламентное задание " + Выборка.Наименование + " было включено";
			тхтТекстПисьма = тхтТекстПисьма + Символы.ПС;
			
		Исключение
			ОтменитьТранзакцию();
			
			тхтТекстПисьма = ?(ПустаяСтрока(тхтТекстПисьма), тхтТекстПисьма, тхтТекстПисьма + Символы.ПС);
			тхтТекстПисьма = тхтТекстПисьма + "регламентное задание " + Выборка.Наименование + " не было включено" + Символы.ПС;
			тхтТекстПисьма = тхтТекстПисьма + ОписаниеОшибки();
			тхтТекстПисьма = тхтТекстПисьма + Символы.ПС;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(тхтТекстПисьма) Тогда			
		РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ВклОтклРегламентныхЗаданий, тхтТекстПисьма, тхтТемаПисьма);
		
	КонецЕсли;
			
КонецПроцедуры
